pages/0_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Unit Overview</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Unit Overview</h1>

<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Topic1</a></li>
      <li><a href="2_Lesson.html">Topic2</a></li>
      <li><a href="3_Lesson.html">Topic3</a></li>
      <li><a href="4_Lesson.html">Topic4</a></li>
      <li><a href="5_Lesson.html">Topic5</a></li>
      <li><a href="Evaluation.html">Evaluation</a></li>
      <li><a href="homework.html">Prep</a></li>
    </ul>
  </div>

<div id="underlay" onclick="underlayoff()">
</div>
<div id="overlay" onclick="overlayoff()">
</div>
<div id=overlayMenu>
<p onclick="overlayon('hsla(0, 0%, 50%, 0.5)')">Grey overlay</p>
<p onclick="underlayon('hsla(300,100%,50%, 0.3)')">Pink</p>
<p onclick="underlayon('hsla(80, 90%, 40%, 0.4)')">Green</p>
<p onclick="underlayon('hsla(240,100%,50%,0.2)')">Blue</p>
<p onclick="underlayon('hsla(40,100%,50%,0.3)')">Cream</p>
<p onclick="underlayon('hsla(300,100%,40%,0.3)')">Liliac</p>
<p onclick="underlayon('hsla(300,100%,25%,0.3)')">Purple</p>
<p onclick="underlayon('hsla(60,100%,50%,0.3)')">Yellow</p>
</div>
<div id="outline-container-org23b080a" class="outline-2 activity">
<h2 id="org23b080a">Overview of this Unit.</h2>
<div class="outline-text-2" id="text-org23b080a">
</div>

<div id="outline-container-org277fe66" class="outline-3 learn">
<h3 id="org277fe66">Developing your skills in problem solving using programming language Python, specifically:</h3>
<div class="outline-text-3" id="text-org277fe66">
<ul class="org-ul">
<li>Understand data types and purposes of variables</li>
<li>Understand the two types of loops and when to use which</li>
<li>Understand the using of conditionals and logic operations</li>
<li>Understand why modular programming is used</li>
</ul>
</div>
</div>

<div id="outline-container-org736631a" class="outline-3 objectives">
<h3 id="org736631a">Objectives</h3>
<div class="outline-text-3" id="text-org736631a">
<p>
<b>Algorithms</b> 
</p>
<ul class="org-ul">
<li>Design simple <b>algorithms</b> using sequences, loops, and selection i.e. if statements.</li>
<li>Design solutions by <b>decomposing</b> a problem into smaller, solvable problems and create a sub-solution for each of these parts</li>
<li>Understand that algorithms are <b>implemented</b> on digital devices as programs. Uses logical reasoning to predict outcomes.</li>
<li>Understand <b>abstraction</b> in problem solving means removing unimportant details to solutions.</li>
<li>Understands that <b>iteration</b> is the <b>repetition of a process</b> such as a loop.</li>
</ul>

<p>
<b>Programming</b>
</p>
<ul class="org-ul">
<li>Creates programs that implement algorithms to achieve given goals.</li>
<li>Declares and assigns variables, appropriate use of sequence, selection (if statement) and repetition (loops) in reaching a solution.</li>
<li>Understands that programming bridges the gap between algorithmic solutions and computers.</li>
<li>Designs, writes and debugs modular programs using functions.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2e6161" class="outline-3 objectives">
<h3 id="orgc2e6161">Key Words and Key Concepts</h3>
<div class="outline-text-3" id="text-orgc2e6161">
<ul class="org-ul">
<li>agorithm</li>
<li>computational thinking</li>
<li>abstraction</li>
<li>pattern recognition</li>
<li>sequence</li>
<li>selection</li>
<li>repetition</li>
<li>function and modular programming</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
